In [19]:
import pandas as pd
import numpy as np

In [20]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'A':['D0','D1','D2','D3']},
                  index = [0,1,2,3])

In [21]:
df1

    A   B   C
0  D0  B0  C0
1  D1  B1  C1
2  D2  B2  C2
3  D3  B3  C3

In [22]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'A':['D4','D5','D6','D7']},
                  index = [4,5,6,7])

In [23]:
df2

    A   B   C
4  D4  B4  C4
5  D5  B5  C5
6  D6  B6  C6
7  D7  B7  C7

In [24]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'A':['D8','D9','D10','D11']},
                  index = [8,9,10,11])

In [25]:
df3

      A    B    C
8    D8   B8   C8
9    D9   B9   C9
10  D10  B10  C10
11  D11  B11  C11

## Concetenation

In [27]:
pd.concat([df1,df2,df3])

      A    B    C
0    D0   B0   C0
1    D1   B1   C1
2    D2   B2   C2
3    D3   B3   C3
4    D4   B4   C4
5    D5   B5   C5
6    D6   B6   C6
7    D7   B7   C7
8    D8   B8   C8
9    D9   B9   C9
10  D10  B10  C10
11  D11  B11  C11

In [28]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    A    B    C    A    B    C
0    D0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1    D1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    D2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    D3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   D4   B4   C4  NaN  NaN  NaN
5   NaN  NaN  NaN   D5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   D6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   D7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   D8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN   D9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  D10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  D11  B11  C11

In [31]:
left = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                    'A':['A0', 'A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                    'C':['C0', 'C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [32]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [33]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merge

In [34]:
pd.merge(left, right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3